Repository: StefanFabian/SolidWorksProjectSwitcher
Catalog: SolidWorksProjectSwitcher/SolidWorksProjectSwitcher/MultilingualResources/SolidWorksProjectSwitcher.*.xlf
Languages: de

source: Cancel
de: Abbrechen

source: Current SolidWorks Project
de: Aktuelles SolidWorks Projekt

source: Delete
de: Löschen

source: Name-prefix:
de: Namens-Präfix:

source: Other SolidWorks projects
de: Andere SolidWorks Projekte

source: Rename current SolidWorks project:
de: Aktuelles SolidWorks Projekt umbenennen:

source: Settings
de: Einstellungen

# SolidWorksRunning
source: SLDWorks is still running!
de: SLDWorks läuft noch!

# SolidWorksRunningInfo
source: As long as SLDWorks is running the directory can not be switched or deleted.
de: Solange SLDWorks noch ausgeführt wird, kann der Ordner nicht gewechselt oder gelöscht werden.

source: Start SolidWorks after switch
de: SolidWorks nach Wechsel starten

source: Switch
de: Wechseln

# SwitchAndDelete
source: Switch and delete current
de: Wechseln und aktuelles Verzeichnis löschen

source: <New SolidWorks project>
de: <Neues SolidWorks Projekt>

source: Error!
de: Fehler!

# ErrorCouldNotStartSolidWorksMessage
source: Maybe the path in the configuration file "solidworkspath.ini" is incorrect!
de: Möglicherweise ist der Pfad in der Konfigurationsdatei "solidworkspath.ini" nicht korrekt!

# ErrorCouldNotStartSolidWorksTitle
source: Could not start SolidWorks!
de: SolidWorks konnte nicht gestartet werden!

# ErrorDeletionFailedMessage
source: %1 could not be deleted.
de: %1 konnte nicht gelöscht werden.

# ErrorDeletionFailedTitle
source: Deletion failed!
de: Löschen fehlgeschlagen!

# ErrorDirectoryExistsMessage
source: A directory with the given name already exists!
de: Es existiert bereits ein Verzeichnis mit dem eingegebenen Namen!

# ErrorDirectoryExistsTitle
source: Directory exists
de: Verzeichnis extistiert bereits!

# ErrorDirectoryNameContainsInvalidCharacters
source: Directory-name contains invalid characters!
de: Verzeichnisname enthält nicht erlaubte Zeichen!

# ErrorFileNotFound
source: File not found!
de: Datei nicht gefunden!

# ErrorSelectedAssociatedDirectoryNotFound
source: The directory that is associated to the selected entry could not be found!
de: Das Verzeichnis zu dem ausgewählten Eintrag wurde nicht gefunden!

# ErrorSelectedDirectoryNotFound
source: The selected directory '%1' could not be found!
de: Das ausgewählte Verzeichnis '%1' wurde nicht gefunden!

# ErrorSolidWorksPathIniMissing
source: Could not start SolidWorks because the configuration file "solidworkspath.ini" could not be found!
de: SolidWorks konnte nicht gestartet werden, da die Konfigurationsdatei "solidworkspath.ini" nicht gefunden wurde!

# ErrorSolidWorksProcessNameIniMissing
source: Could not check if SolidWorks is running because the configuration file "solidworksprocessname.ini" was not found! To prevent errors, it is assumed that SolidWorks is still running.
de: Es konnte nicht festgestellt werden, ob SolidWorks aktiv ist, da die Konfigurationsdatei "solidworksprocessname.ini" nicht gefunden wurde! Um Fehlern vorzubeugen, wird davon ausgegangen, dass SolidWorks noch aktiv ist.

# ErrorSolidWorksProjectPathNotSet
source: SolidWorks project folder path must be set in solidworksprojectfolder.ini! For example: 'C:\swlocal'
de: Der SolidWorks Projekt-Ordner Pfad muss in der Datei solidworksprojectfolder.ini gesetzt werden! Zum Beispiel: 'C:/swlocal'

source: <Unknown>
de: <Unbekannt>

source: Warning!
de: Achtung!

# WarningDeleteConfirmationMessage
source: Are you sure you want to delete "%1"?
de: Sind Sie sicher, dass sie das Verzeichnis "%1" löschen möchten?

# WarningDeleteDirectory
source: Are you sure you want to delete the current %1 directory?
de: Sind Sie sicher, dass Sie das aktuelle %1 Verzeichnis löschen möchten?
